# 1. Градусник.
# Дано: список градусов Цельсия.
#
# Задание: написать функцию, которая преобразовывает исходный список градусов Цельсия в список градусов Фаренгейта
#
# Пример:
#
#  [39.2, 36.5, 37.3, 37.8], результат:
#  [102.56, 97.700000000000003, 99.140000000000001, 100.03999999999999]

def cels_to_fahr(cel_list):
    fahr_list = [(cel * 9/5) + 32 for cel in cel_list]
    return fahr_list

cel_list = [39.2, 36.5, 37.3, 37.8]
fahrenheit_list = cels_to_fahr(cel_list)
print(fahrenheit_list)
